# Problem set : 2 (Data Programming)

# Problem : 1

In [1]:
def c(a):
    return a+2

In [2]:
a=0
def b():
    global a
    a=c(a)

In [3]:
b()

1> we have kept a=0 which is a global variable as it is outside of function and intitialed value of a is 0

2> when b() is getting executed for the first time we have kept global a that means in b() function whenever we will refer to a it will be the global a not the local a.

3> a=c(a) so it will call c() function and the global value of a is passed to c function as a parameter.

4> c() will be executed in which it is basically taking a and returning a+2 for example value of a will be increased by 2.

5> The pointer returns back to a=c(a) and the value returned from c() function will be stored in global a as it is in b().

6> The value of a will be 0+2 after this execution, hence the value of a will be 0+2 for example a=2.

In [4]:
b()

1> The value of global a is already 2 which was done in last step

2> Now when b() is called global a will be reffred to a value and in b() function wherever we will refer to a it will the global a not the local a

3> a=c(a) so it will call c() function and the value of a is passed to c function as a parameter

4> c() will be executed iin which it is basically taking a and returning a+2 for example value will be increased by 2

5> The pointer returns back a=c(a) and the value returned from c() function will stored in global a as it is in b(0).

6> Already value of a was 2 and after this execution the value will be 2+2.Hence,the value of a will be 4.

In [5]:
b()

1> The value of global a is now 4 which was done in previous step.

2> Now when b() is called global a will be reffered to a value and in b() function wherever we will refer to a it will be the global a not the local a

3> a=c(a) so it will call c() function and the global value of a is passed to c function as a parameter

4> c() will be executed in which it is basically taking a and returning a+2 i.e. value of a will be increased by 2

5> The pointer returns back to a=c(a) and the value returned from c() function will be stored in global a as it is in b().

6> The already value of a was 2 and after this execution the value will be 4+2. Hence,the value of a will be 6

In [6]:
a

6

# Problem : 2

In [7]:
def fileLength(f_name):
    try:
        file = open(f_name)
        values = file.read()
        file.close()
        print(len(values))
    except FileNotFoundError:
        print(f"File {f_name} is not found.")
    
        

fileLength(r'C:\Users\Owner\OneDrive - Georgian College\Desktop\Test file.txt')
fileLength(r'C:\Users\Owner\OneDrive - Georgian College\Desktop\Test file 254.txt')

137
File C:\Users\Owner\OneDrive - Georgian College\Desktop\Test file 254.txt is not found.

# Problem : 3

In [8]:
class Marsupial: 
    def __init__(self):
        self.pouch = []
    
    def pouch_contents(self):
        return self.pouch
    
    def put_in_pouch(self, item):
        self.pouch.append(item)
        
class Kangaroo(Marsupial):
    def __init__(self, x=0, y=0):
        super().__init__()
        self.x = x
        self.y = y

    def jump(self, dx, dy):
        self.x += dx
        self.y += dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

In [9]:
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()
print(m.pouch_contents())

['doll', 'firetruck', 'kitten']

In [10]:
k = Kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

# Problem : 4

In [11]:
def collatz(x):
    print(x)
    if x == 1:
        return 
    elif x % 2 == 0:    ## x is even
        x = x // 2
        return collatz(x)
    else:
        x = 3 * x + 1   ## x is odd
        return collatz(x)

In [12]:
print('collatz(1)')        
collatz(1)

collatz(1)
1

In [13]:
print('collatz(10)')
collatz(10)

collatz(10)
10
5
16
8
4
2
1

# Problem : 5

In [14]:
def binary(n):
    if n<0:
        print("Enter a non negative number")
    elif n==0:
        return
    else:
        binary(n // 2)
    print(n%2,end='')

In [15]:
binary(0)

In [16]:
binary(1)

1

In [17]:
binary(3)

11

In [18]:
binary(9)

1001

# Problem : 9

In [21]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

In [22]:
# LIST a

word_up=[word.upper() for word in words]
print(word_up)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [23]:
# LIST b

word_lo=[word.lower() for word in words]
print(word_lo)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [24]:
#LIST c

word_len=[len(word) for word in words]
print(word_len)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [25]:
#LIST d

word_up_lo_len=[[word.upper(),word.lower(),len(word)]for word in words]
print(word_up_lo_len)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [26]:
#LIST e

word_len_above_4 = [word for word in words if len(word)>=4]
print(word_len_above_4 )

['quick', 'brown', 'jumps', 'over', 'lazy']

# Problem : 8

In [1]:
import pandas as pd
import sqlite3

# Data to be inserted
data = [
    ('Mumbai', 'India', 'Winter', 24.8, 5.9),
    ('Mumbai', 'India', 'Spring', 28.4, 16.2),
    ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
    ('Mumbai', 'India', 'Fall', 27.6, 346.0),
    ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
    ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
    ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
    ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
    ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
    ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
    ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
    ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)
]

# Create a DataFrame from the data
df = pd.DataFrame(data, columns=['City', 'Country', 'Season', 'Temperature', 'Rainfall'])

# Creating sqlite3 database
conn = sqlite3.connect('Weatherdata.db')

# Inserting data into the seasons_data table
df.to_sql('seasons_data', conn, if_exists='replace', index=False)

12

In [2]:
## Question : A : All the temprature data
a = pd.DataFrame(conn.execute("SELECT Temperature FROM seasons_data"))

a.columns = ['Temperature']
a

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

In [3]:
## Question : B :All the cities, but without repetition
b = pd.DataFrame(conn.execute("SELECT DISTINCT City FROM seasons_data"))

b.columns = ['City']
b

     City
0  Mumbai
1  London
2   Cairo

In [4]:
## Question : C : All the records for India
c = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Country='India'"))

c.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
c

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

In [5]:
## Question : D : All the Fall records.

d = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Season='Fall'"))

d.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
d

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

In [6]:
## Question : E : The city, country, and season for which the average rainfall is between 200 and 400millimeters.

e = pd.DataFrame(conn.execute("""
    SELECT City, Country, Season
    FROM seasons_data
    GROUP BY City, Country, Season
    HAVING AVG(Rainfall) BETWEEN 200 AND 400
"""))

e.columns = ['City', 'Country', 'Season']
e

     City         Country  Season
0  London  United Kingdom    Fall
1  London  United Kingdom  Winter
2  Mumbai           India    Fall

In [7]:
##Question : F : The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order

f = pd.DataFrame(conn.execute("""
    SELECT City, Country
    FROM seasons_data
    WHERE Season='Fall'
    GROUP BY City, Country
    HAVING AVG(Temperature) > 20
    ORDER BY AVG(Temperature)
"""))

f.columns = ['City', 'Country']
f

     City Country
0   Cairo   Egypt
1  Mumbai   India

In [8]:
## Question : G : The total annual rainfall for Cairo

g = pd.DataFrame(conn.execute("""
    SELECT SUM(Rainfall) AS total_annual_rainfall
    FROM seasons_data
    WHERE City='Cairo'
"""))

g = g.rename(columns={0: 'Total Annual Rainfall'})
g

   Total Annual Rainfall
0                   27.6

In [9]:
## Question : H : The total rainfall for each season.

h = pd.DataFrame(conn.execute("""
    SELECT Season, SUM(Rainfall) AS total_rainfall
    FROM seasons_data
    GROUP BY Season
"""))
h = h.rename(columns={0: 'Season', 1: 'Total Rainfall'})
h

   Season  Total Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

In [10]:
## Commit chnages and close connection
conn.commit()
conn.close()